//以中文词语作为数组键名极大的简化了后续的操作，是复杂度降低为一步
//词汇来源于百度分词词库部分内容，总词汇量达十多万条
 
var W=new Array();
 
W["印第安纳波利斯"]=1;
W["氧化琥珀酰胆碱"]=1;
W["乌里扬诺夫斯克"]=1;
W["苏克·阿赫拉斯"]=1;
W["水杨酸毒扁豆碱"]=1;
W["圣佩德罗－苏拉"]=1;
W["圣基茨和尼维斯"]=1;
W["瑟伊藻克罗屈尔"]=1;
W["梅尔库里亚丘克"]=1;
W["马斯耶德所罗门"]=1;
W["洛赫吉尔普黑德"]=1;
W["氯甲酸三氯甲酯"]=1;
W["勒姆尼库沃尔恰"]=1;
W["坎星顿－切尔西"]=1;
W["卡加延-德奥罗"]=1;
W["聚乙烯醇缩甲醛"]=1;
W["聚乙烯醇缩丁醛"]=1;
W["甲基丙烯酸甲酯"]=1;
W["磺胺二甲基嘧啶"]=1;
W["哈拉帕恩里克斯"]=1;
W["符拉迪沃斯托克"]=1;
W["二巯基丁二酸钠"]=1;
W["二巯基丙磺酸钠"]=1;
W["多斯格布拉达斯"]=1;
W["布宜诺斯艾利斯"]=1;
W["布拉戈维申斯克"]=1;
W["博斯普鲁斯海峡"]=1;
W["彼得罗扎沃茨克"]=1;
W["安提瓜和巴布达"]=1;