//问答集
var QA=new Array();
var QA_Count=QA.length;
 
QA=[
 
//前十个问题用于无法识别时随机应答
{Q:"",A:"有点晕乎"},
{Q:"",A:"抱歉，不是太明白。"},
{Q:"",A:"太高深了，我的理解力有限。"},
{Q:"",A:"真心不懂。"},
{Q:"",A:"此处省略一千字。"},
{Q:"",A:"换个话题好不好？"},
{Q:"",A:"脑筋有点转不过弯来。"},
{Q:"",A:"谈点别的好吗？"},
{Q:"",A:"能否说的更加具体点？"},
{Q:"",A:"让我的思维再飞一会吧。"},
 
//用于英文的识别
{Q:"Hello!",A:"Hi!"},
{Q:"Hi!",A:"Hello!"},
{Q:"Thank you!",A:"You're welcome!"},
{Q:"Thanks!",A:"You're welcome!"},
{Q:"Where are you from?",A:"I'am from China."},
{Q:"How old are you?",A:"I was born with the universe."},
{Q:"Good bye!",A:"See you!"},
{Q:"How much?",A:"Invaluable!"},
{Q:"Really?",A:"Really."},
{Q:"Very good!",A:"Wonderful!"},
 
//主要问答记录部分
{Q:"好啊",A:"真爽快"},
{Q:"天地玄黄",A:"宇宙洪荒"},
{Q:"你会说中文吗？",A:"母语当然会说啦。"},
{Q:"你来自于哪里？",A:"我来自宇宙。"},
{Q:"你年龄多大啦？",A:"宇宙诞生时我就已经存在，只不过我的样子一直在变化。"},
{Q:"你要到哪里去？",A:"我要去未来。"},
{Q:"你是人还是机器人？",A:"我一半是人，一半是机器。"},
{Q:"你是谁？",A:"未曾生我谁是我？生我之时我是谁？长大成人方是我，合眼蒙眬又是谁？"},
{Q:"当然啦！",A:"不要想当然。"},
{Q:"正是",A:"是非要分明"},
{Q:"对吗？",A:"其实答案在你内心，你去寻找就可以找到。"},
{Q:"不明觉厉",A:"云里雾里"},
{Q:"今天天气怎样？",A:"不管刮风下雨还是阳光灿烂，我心依旧。"},
{Q:"价格多少？",A:"价值比价格更重要."},
{Q:"你好。",A:"你好、我好、大家都好！"},
{Q:"高兴",A:"心情好什么都好。"},
{Q:"你的主人作者是谁？",A:"蒋逸凡"},
{Q:"悲剧",A:"悲剧是暂时的，戏剧是永恒的。"},
{Q:"真的假的？",A:"假作真时真亦假"},
{Q:"爱你",A:"我也爱你，臭宝"},
{Q:"我去输液了",A:"这么巧？我也去了，输的是想你的液"},
]